>>> server -> client: 0x00BB, 0x00AA
>>> Cycle()
>> 01 03 00 14 00 02 84 0F
Modbus ErrorCallback: <modbus:1:holding: 20>: no error
Modbus Callback: <modbus:1:holding: 20> becomes 11141307
<< 01 03 04 00 BB 00 AA 0A 69
>> 01 03 00 18 00 04 C4 0E
Modbus ErrorCallback: <modbus:1:holding: 24>: no error
Modbus Callback: <modbus:1:holding: 24> becomes 0
<< 01 03 08 00 00 00 00 00 00 00 00 95 D7
>>> client -> server: -2
>>> Cycle()
>> 01 10 00 14 00 02 04 FF FE FF FF A3 04
<< 01 10 00 14 00 02 01 CC
>> 01 03 00 14 00 02 84 0F
Modbus Callback: <modbus:1:holding: 20> becomes -2 [unchanged]
<< 01 03 04 FF FE FF FF AA 67
>> 01 03 00 18 00 04 C4 0E
Modbus Callback: <modbus:1:holding: 24> becomes 0 [unchanged]
<< 01 03 08 00 00 00 00 00 00 00 00 95 D7
>>> client -> server: 10
>>> Cycle()
>> 01 10 00 18 00 04 08 00 DD 00 CC 00 BB 00 AA 7B 1D
<< 01 10 00 18 00 04 41 CD
>> 01 03 00 14 00 02 84 0F
Modbus Callback: <modbus:1:holding: 20> becomes -2 [unchanged]
<< 01 03 04 FF FE FF FF AA 67
>> 01 03 00 18 00 04 C4 0E
Modbus Callback: <modbus:1:holding: 24> becomes 47851549213065437 [unchanged]
<< 01 03 08 00 DD 00 CC 00 BB 00 AA 78 90
(pty-based fake serial -- stopping forwarding)
